# Day 1 Mission

## 과제 1
 - 다음의 파일 3개를 로드하고(1), 각 파일의 행과 열의 개수를 출력(2)해보세요.
이 때, 파일의 구분자를 잘 확인하여 로드해보세요.


    - test_csv_file.csv
    - test_text_file.txt
    - text_without_column_name.txt

In [1]:
import pandas as pd

In [4]:
data_csv = pd.read_csv('./data/test_csv_file.csv',)

In [5]:
data_csv

   ID LAST_NAME  AGE
0   1       KIM   30
1   2      CHOI   25
2   3       LEE   41
3   4      PARK   19
4   5       LIM   36

In [6]:
data_txt = pd.read_csv('./data/test_text_file.txt')

In [7]:
data_txt

   ID|A|B|C|D
0  C1|1|2|3|4
1  C2|5|6|7|8
2  C3|1|3|5|7

In [ ]:
#구분자 주의해서 데이터 다시 로드

In [8]:
data_txt = pd.read_csv('./data/test_text_file.txt', sep='|')

In [9]:
data_txt

   ID  A  B  C  D
0  C1  1  2  3  4
1  C2  5  6  7  8
2  C3  1  3  5  7

In [10]:
data_txt2 = pd.read_csv('./data/text_without_column_name.txt')
data_txt2

   C1|1|2|3|4
0  C2|5|6|7|8
1  C3|1|3|5|7

In [15]:
data_txt2 = pd.read_csv('./data/text_without_column_name.txt', header =None, sep = '|')
data_txt2

    0  1  2  3  4
0  C1  1  2  3  4
1  C2  5  6  7  8
2  C3  1  3  5  7


-  다음의 파일을 로드하는데, 다음의 제약사항을 지켜 로드해보세요  


    - train.csv
    - 첫번째 행은 빼고 상위 5개의 행(2, 3, 4, 5, 6)만 로드
    - PassengerId 컬럼을 Index column 으로 지정
    - 가장 상위 row 를 header 로 지정
    - ?, ??, N/A, nan, NaN 을 결측값으로 지정

In [19]:
train = pd.read_csv('C:/Users/hskyu/Documents/GitHub/rfriend-python-study/day1/data/train.csv')

In [20]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [46]:
train = pd.read_csv('C:/Users/hskyu/Documents/GitHub/rfriend-python-study/day1/data/train.csv',
                    index_col='PassengerId', skiprows=[1], nrows=5, header = 0)
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [47]:
train.isna().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         1
SibSp       0
Parch       0
Ticket      0
Fare        0
Cabin       3
Embarked    0
dtype: int64

## 과제 2
- 다음의 데이터를 DataFrame으로 생성 후 csv file로 만들어 보세요
이 때, 아래의 제약조건을 to_csv 함수 내에서 설정하여 만들어 보세요
소수점은 둘째자리까지만 설정해주세요
X3 컬럼은 빼주세요

```
data = {'ID': ['A1', 'A2', 'A3', 'A4', 'A5'],
        'X1': [1, 2, 3, 4, 5],
        'X2': [3.0132, 4.532, 3.2113, 4.023, 3.543],
        'X3': ['my', 'name', 'is', 'jaehun', 'heo']}
```

In [48]:
data = {'ID': ['A1', 'A2', 'A3', 'A4', 'A5'],
        'X1': [1, 2, 3, 4, 5],
        'X2': [3.0132, 4.532, 3.2113, 4.023, 3.543],
        'X3': ['my', 'name', 'is', 'jaehun', 'heo']}

In [51]:
data_df = pd.DataFrame(data)
data_df

   ID  X1      X2      X3
0  A1   1  3.0132      my
1  A2   2  4.5320    name
2  A3   3  3.2113      is
3  A4   4  4.0230  jaehun
4  A5   5  3.5430     heo

In [54]:
data_df.to_csv('./data_df.csv',columns=['ID', 'X1', 'X2'],float_format='%.2f' )

In [59]:
#확인
data_df2 = pd.read_csv('data_df.csv', index_col=0)
data_df2

   ID  X1    X2
0  A1   1  3.01
1  A2   2  4.53
2  A3   3  3.21
3  A4   4  4.02
4  A5   5  3.54

- 위의 DataFrame 의 다음의 attirbute를 조회해 보세요
```
transpose
행과 열 이름
dataFrame의 데이터 형태
행과 열의 개수를 튜플로 반환
```

In [61]:
#transpose
data_df2.transpose()

       0     1     2     3     4
ID    A1    A2    A3    A4    A5
X1     1     2     3     4     5
X2  3.01  4.53  3.21  4.02  3.54

In [65]:
#행과 열의 이름
data_df2.axes

[Int64Index([0, 1, 2, 3, 4], dtype='int64'),
 Index(['ID', 'X1', 'X2'], dtype='object')]

In [66]:
#df의 형태
data_df2.dtypes

ID     object
X1      int64
X2    float64
dtype: object

In [67]:
#행과 열의 개수를 튜플로 반환
data_df2.shape

(5, 3)

## 과제 3
- 다음의 데이터를 로드해 보세요
```
{'class_1': ['a', 'a', 'b', 'b', 'c'],
            'var_1': np.arange(5),
            'var_2': np.random.randn(5)}
```

```
'r0' ,'r1' ,'r2', 'r3', 'r4' 문자열을 index 로 지정하세요
'r0', 'r1' index 행만 선택하여 출력해보세요
'class_1', 'var_2' 컬럼만 선택하여 출력해보세요
```

In [70]:
import numpy as np

In [82]:
data_class  = pd.DataFrame(
    {'class_1': ['a', 'a', 'b', 'b', 'c'],
          'var_1': np.arange(5),
          'var_2': np.random.randn(5)},
    index=['r0', 'r1', 'r2', 'r3', 'r4']
)
data_class

   class_1  var_1     var_2
r0       a      0 -0.238366
r1       a      1  0.445818
r2       b      2  1.044248
r3       b      3 -0.664239
r4       c      4 -1.669990

In [88]:
data_class.index

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')

In [100]:
data_class.iloc[:2]

   class_1  var_1     var_2
r0       a      0 -0.238366
r1       a      1  0.445818

In [106]:
data_class.columns

Index(['class_1', 'var_1', 'var_2'], dtype='object')

In [108]:
data_class[['class_1', 'var_2']]

   class_1     var_2
r0       a -0.238366
r1       a  0.445818
r2       b  1.044248
r3       b -0.664239
r4       c -1.669990